/*  Сформируйте трёхмерный массив из неповторяющихся двузначных чисел. 
    Напишите программу, которая будет построчно выводить массив, добавляя индексы каждого элемента.
    Массив размером 2 x 2 x 2
    66(0,0,0) 25(0,1,0)
    34(1,0,0) 41(1,1,0)
    27(0,0,1) 90(0,1,1)
    26(1,0,1) 55(1,1,1) */

//Задала трехмерный массив вручную:
int[,,] array3D = 
                {
                    {
                        {66, 25},
                        {34, 41}
                    },
                    {
                        {27, 90},
                        {26, 55}
                    }
                };
PrintArray3D(array3D);


// Метод вывода трехмерного массива с  индексами на консоль
void PrintArray3D(int[,,] array)
{
    for (int i = 0; i < array.GetLength(0); i++)
    {
        Console.WriteLine("Страница № " + (i + 1));
        for (int j = 0; j < array.GetLength(1); j++)
        {
            for (int k = 0; k < array.GetLength(2); k++)
            {
                Console.Write("["+ i + ", " + j + ", " + k + "] " + array[i, j, k] + "\t");
            }
            Console.WriteLine();
        }
        Console.WriteLine();
    }
    Console.WriteLine();
}